app/controllers/sessions_controller.rb

INSERT INTO "authentications" ("provider", "uid", "name", "nickname", "image", "location", "token", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = ? AND "authentications"."uid" = ? LIMIT 1  [["provider", "twitter"], ["uid", "5142011"]]
INSERT INTO "users" ("name", "image", "last_login_provider", "last_login_at", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def callback
    auth = request.env["omniauth.auth"]
    authentication = Authentication.find_by(provider: auth["provider"], uid: auth["uid"]) || Authentication.create_with_omniauth(auth)
    authentication.auth_update(auth)

    # User Creation
    user = User.find_by(id: authentication.user_id) || User.create_with_auth(authentication, request)